* Linear Mixer

#+begin_src yaml
energyConvergence: &energyConvergence 1e-8
amplitudesConvergence: &amplitudesConvergence 1e-8
maxIterations: &maxIterations 50
mixer: &mixer "LinearMixer"
maxResidua: &maxResidua 4
#+end_src


|      ccsd ref |          ccsd |  Δ |         uccsd | ccsd - uccsd |
|---------------+---------------+----+---------------+--------------|
| -0.1342281419 | -0.1342281419 | 0. | -0.1342281419 |           0. |
| -0.1331608242 | -0.1331608242 | 0. | -0.1331608242 |           0. |
| -0.1359315433 | -0.1359315433 | 0. | -0.1359315433 |           0. |
| -0.1363325732 | -0.1363325732 | 0. | -0.1363325732 |           0. |
| -0.1365672327 | -0.1365672327 | 0. | -0.1365672327 |           0. |
| -0.1366418494 | -0.1366418494 | 0. | -0.1366418494 |           0. |
| -0.1366741975 | -0.1366741975 | 0. | -0.1366741975 |           0. |
| -0.1366867564 | -0.1366867564 | 0. | -0.1366867564 |           0. |
| -0.1366920034 | -0.1366920034 | 0. | -0.1366920034 |           0. |
| -0.1366941581 | -0.1366941581 | 0. | -0.1366941581 |           0. |
| -0.1366950618 | -0.1366950618 | 0. | -0.1366950618 |           0. |
| -0.1366954411 | -0.1366954411 | 0. | -0.1366954411 |           0. |
| -0.1366956017 | -0.1366956017 | 0. | -0.1366956017 |           0. |
|   -0.13669567 |   -0.13669567 | 0. |   -0.13669567 |           0. |
| -0.1366956992 | -0.1366956992 | 0. | -0.1366956992 |           0. |
| -0.1366957117 | -0.1366957117 | 0. | -0.1366957117 |           0. |
| -0.1366957171 | -0.1366957171 | 0. | -0.1366957171 |           0. |
| -0.1366957194 | -0.1366957194 | 0. | -0.1366957194 |           0. |
| -0.1366957204 | -0.1366957204 | 0. | -0.1366957204 |           0. |
| -0.1366957209 | -0.1366957209 | 0. | -0.1366957209 |           0. |
| -0.1366957211 | -0.1366957211 | 0. | -0.1366957211 |           0. |
| -0.1366957211 | -0.1366957211 | 0. | -0.1366957211 |           0. |
| -0.1366957212 | -0.1366957212 | 0. | -0.1366957211 |        1e-10 |
#+TBLFM: $3=$1 - $2::$5=$4 - $2


|         ccsdt |        uccsdt |           Δ |
|---------------+---------------+-------------|
| -0.1342281419 | -0.1342281419 |          0. |
| -0.1331608242 | -0.1331608242 |          0. |
| -0.1376790139 | -0.1376790139 |          0. |
| -0.1376256852 | -0.1376256852 |          0. |
| -0.1380459069 | -0.1380459069 |          0. |
| -0.1380811541 | -0.1380811541 |          0. |
| -0.1381343423 | -0.1381343423 |          0. |
| -0.1381440542 | -0.1381440542 |          0. |
|  -0.138152149 |  -0.138152149 |          0. |
| -0.1381542196 | -0.1381542196 |          0. |
|   -0.13815559 |   -0.13815559 |          0. |
| -0.1381560072 | -0.1381560072 |          0. |
| -0.1381562542 | -0.1381562542 |          0. |
| -0.1381563376 | -0.1381563376 |          0. |
| -0.1381563839 | -0.1381563839 |          0. |
| -0.1381564007 | -0.1381564007 |          0. |
| -0.1381564097 | -0.1381564097 |          0. |
| -0.1381564131 | -0.1381564131 |          0. |
| -0.1381564149 | -0.1381564149 |          0. |
| -0.1381564156 | -0.1381564156 |          0. |
| -0.1381564159 | -0.1381564159 |          0. |
| -0.1381564161 | -0.1381564161 |          0. |
| -0.1381564161 | -0.1381564161 |          0. |
#+TBLFM: $3=$1 - $2

* Diis mixer 4 residua

#+begin_src yaml
  energyConvergence: &energyConvergence 1e-8
  amplitudesConvergence: &amplitudesConvergence 1e-8
  maxIterations: &maxIterations 50
  mixer: &mixer "DiisMixer"
  maxResidua: &maxResidua 4
#+end_src


|      ccsd ref |          ccsd |  Δ |         uccsd | ccsd - uccsd |
|---------------+---------------+----+---------------+--------------|
| -0.1342281419 | -0.1342281419 | 0. | -0.1342281419 |           0. |
| -0.1331566606 | -0.1331566606 | 0. | -0.1332020825 |  -4.54219e-5 |
| -0.1361104777 | -0.1361104777 | 0. | -0.1364123242 | -3.018465e-4 |
| -0.1366712001 | -0.1366712001 | 0. | -0.1366902462 |  -1.90461e-5 |
| -0.1366940625 | -0.1366940625 | 0. | -0.1366969792 |   -2.9167e-6 |
| -0.1366980973 | -0.1366980973 | 0. | -0.1366972906 |     8.067e-7 |
| -0.1366952373 | -0.1366952373 | 0. | -0.1366951225 |     1.148e-7 |
| -0.1366956092 | -0.1366956092 | 0. | -0.1366956566 |     -4.74e-8 |
| -0.1366956439 | -0.1366956439 | 0. | -0.1366956406 |       3.3e-9 |
| -0.1366957118 | -0.1366957118 | 0. | -0.1366957141 |      -2.3e-9 |
| -0.1366957171 | -0.1366957171 | 0. | -0.1366957164 |        7e-10 |
| -0.1366957211 | -0.1366957211 | 0. | -0.1366957207 |        4e-10 |
| -0.1366957211 | -0.1366957211 | 0. | -0.1366957211 |           0. |
| -0.1366957212 | -0.1366957212 | 0. | -0.1366957212 |           0. |
#+TBLFM: $3=$1 - $2::$5=$4 - $2


|         ccsdt |        uccsdt |           Δ |
|---------------+---------------+-------------|
| -0.1342281419 | -0.1342281419 |          0. |
| -0.1332020805 | -0.1332837658 |  8.16853e-5 |
| -0.1375951477 | -0.1375041089 | -9.10388e-5 |
| -0.1382943285 | -0.1379844955 | -3.09833e-4 |
| -0.1381850405 | -0.1381233257 | -6.17148e-5 |
| -0.1381878412 | -0.1381663389 | -2.15023e-5 |
| -0.1381546768 |  -0.138156609 |   1.9322e-6 |
| -0.1381566858 | -0.1381579137 |   1.2279e-6 |
| -0.1381561858 | -0.1381568278 |     6.42e-7 |
| -0.1381563477 | -0.1381565967 |     2.49e-7 |
| -0.1381564035 | -0.1381564808 |     7.73e-8 |
| -0.1381564177 | -0.1381564202 |      2.5e-9 |
| -0.1381564174 | -0.1381564219 |      4.5e-9 |
| -0.1381564169 | -0.1381564156 |     -1.3e-9 |
| -0.1381564165 | -0.1381564159 |      -6e-10 |
| -0.1381564162 |  -0.138156416 |      -2e-10 |
| -0.1381564162 | -0.1381564161 |      -1e-10 |
| -0.1381564162 | -0.1381564162 |          0. |
#+TBLFM: $3=$1 - $2
